Revit 2027 API
StructuralAsset.Lightweight Property
 Flag indicating whether the asset describes a material that is light-weight or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Lightweight { get; set; }
Public Property Lightweight As Boolean
	Get
	Set
public:
property bool Lightweight {
	bool get ();
	void set (bool value);
}
member Lightweight : bool with get, set
Property Value
Boolean
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace